Repository: Jidapa5/dsi202_2025
Catalog: locale/*/LC_MESSAGES/django.po
Languages: th

source: Required. Please enter a valid email address.
th: จำเป็น กรุณากรอกอีเมลที่ถูกต้อง

source: First Name
th: ชื่อ

source: Last Name
th: นามสกุล

source: An account with this email already exists.
th: มีบัญชีผู้ใช้อีเมลนี้อยู่แล้ว

source: Email
th: อีเมล

source: Phone Number
th: หมายเลขโทรศัพท์

source: Shipping Address
th: ที่อยู่สำหรับจัดส่ง

source: Rental Start Date
th: วันที่เริ่มเช่า

source: Return Date
th: วันที่ส่งคืนสินค้า

source: Return date cannot be before the start date.
th: วันที่ส่งคืนสินค้าต้องไม่กำหนดก่อนวันที่เริ่มเช่า

source: dd/mm/yyyy hh:mm
th: วว/ดด/ปปปป ชช:นน

source: This email address is already in use by another account.
th: อีเมลนี้ถูกใช้งานโดยบัญชีอื่นแล้ว

source: Saved Address (for faster checkout)
th: ที่อยู่ที่บันทึกไว้ (เพื่อการสั่งซื้อที่รวดเร็วยิ่งขึ้น)

source: Return Tracking Number
th: หมายเลขพัสดุสำหรับส่งคืน

source: Attach Return Slip/Parcel Photo
th: แนบสลิปคืนสินค้า หรือรูปถ่ายพัสดุ

source: Category Name
th: ชื่อหมวดหมู่

source: Used for URL (auto-generated if blank)
th: ใช้สำหรับ URL (ระบบจะสร้างอัตโนมัติหากเว้นว่าง)

source: Category
th: หมวดหมู่

source: Categories
th: หมวดหมู่สินค้า

source: Outfit Name
th: ชื่อชุด

source: Description
th: รายละเอียดสินค้า

source: Image
th: รูปภาพ

source: Rental Price per Day
th: ราคาเช่าต่อวัน

source: Active
th: พร้อมให้เช่า

source: Outfit
th: ชุด

source: Outfits
th: ชุดทั้งหมด

source: Pending Payment
th: รอการชำระเงิน

source: Waiting for Payment Approval
th: รอการอนุมัติชำระเงิน

source: Payment Failed
th: การชำระเงินล้มเหลว

source: Processing
th: กำลังเตรียมชุด

source: Shipped to Customer
th: จัดส่งให้ลูกค้าแล้ว

source: Rented (With Customer)
th: อยู่ระหว่างลูกค้าเช่า

source: Return Shipped by Customer
th: ลูกค้าส่งสินค้าคืนแล้ว

source: Return Received
th: ได้รับสินค้าคืนแล้ว

source: Completed
th: รายการเช่าเสร็จสมบูรณ์

source: Cancelled
th: ยกเลิกแล้ว

source: User
th: ผู้ใช้งาน

source: Rental End Date
th: วันที่สิ้นสุดการเช่า

source: Total Amount
th: ยอดชำระรวม

source: Created At
th: สร้างเมื่อ

source: Updated At
th: อัปเดตล่าสุด

source: Status
th: สถานะ

source: Payment Confirmed
th: การชำระเงินได้รับการยืนยันแล้ว

source: Payment Method
th: วิธีชำระเงิน

source: Payment Slip
th: สลิปชำระเงิน

source: Payment Date/Time (Reported)
th: วันที่/เวลาชำระเงิน (ตามที่แจ้ง)

source: Admin Payment Note
th: หมายเหตุจากแอดมิน (การชำระเงิน)

source: Shipping Cost
th: ค่าจัดส่ง

source: Shipping Tracking No.
th: เลขพัสดุสำหรับจัดส่ง (ถึงลูกค้า)

source: Return Tracking No.
th: เลขพัสดุสำหรับส่งคืน (ถึงเรา)

source: Return Slip/Photo
th: สลิป/รูปถ่ายการส่งคืน

source: Return Initiated At
th: วันที่เริ่มดำเนินการส่งคืน

source: Rental Order
th: คำสั่งเช่า

source: Rental Orders
th: คำสั่งเช่าทั้งหมด

source: Rental end date cannot be before the start date.
th: วันที่สิ้นสุดการเช่าต้องไม่กำหนดก่อนวันที่เริ่มเช่า

source: Price per Day (at time of order)
th: ราคาเช่าต่อวัน (ณ วันที่สั่งซื้อ)

source: Quantity
th: จำนวน

source: Order Item
th: รายการสินค้าในคำสั่งเช่า

source: Order Items
th: รายการสินค้าทั้งหมดในคำสั่งเช่า

source: Saved Address
th: ที่อยู่ที่บันทึกไว้

source: User Profile
th: โปรไฟล์ผู้ใช้

source: User Profiles
th: โปรไฟล์ผู้ใช้ทั้งหมด

source: Sign In
th: เข้าสู่ระบบ

source: Sign in with Google
th: เข้าสู่ระบบด้วย Google

source: Sign in with Email (Optional)
th: เข้าสู่ระบบด้วยอีเมล (หรือไม่ก็ได้)

source: Forgot Password?
th: ลืมรหัสผ่านใช่หรือไม่?

source: Don’t have an account?
th: ยังไม่มีบัญชีใช่ไหม?

source: Sign up
th: สมัครสมาชิก

source: Log Out
th: ออกจากระบบ

source: Are you sure you want to log out?
th: คุณแน่ใจหรือไม่ว่าต้องการออกจากระบบ?

source: Cancel
th: ยกเลิก

source: Password Reset
th: รีเซ็ตรหัสผ่าน

source: Reset Your Password
th: รีเซ็ตรหัสผ่านของคุณ

source: Enter your email address and we’ll send you a link to reset your password.
th: กรอกอีเมลของคุณ แล้วเราจะส่งลิงก์สำหรับรีเซ็ตรหัสผ่านไปให้

source: Email address
th: ที่อยู่อีเมล

source: Send Reset Link
th: ส่งลิงก์รีเซ็ตรหัสผ่าน

source: Back to Sign In
th: กลับไปหน้าเข้าสู่ระบบ

source: Password Reset Sent
th: ส่งคำขอรีเซ็ตรหัสผ่านแล้ว

source: Check Your Email
th: ตรวจสอบอีเมลของคุณ

source: If an account exists with the email you entered, you will receive a password reset link shortly.
th: หากมีบัญชีที่ผูกกับอีเมลนี้ คุณจะได้รับลิงก์สำหรับรีเซ็ตรหัสผ่านในไม่ช้า

source: Be sure to check your spam folder too!
th: อย่าลืมตรวจสอบในโฟลเดอร์จดหมายขยะ (Spam) ด้วยนะคะ!

source: Set New Password
th: ตั้งรหัสผ่านใหม่

source: Reset Password
th: รีเซ็ตรหัสผ่าน

source: Password Reset Successful
th: รีเซ็ตรหัสผ่านสำเร็จ

source: Password Changed
th: เปลี่ยนรหัสผ่านเรียบร้อยแล้ว

source: Your password has been set. You can now log in with your new password.
th: ตั้งรหัสผ่านใหม่สำเร็จ คุณสามารถเข้าสู่ระบบด้วยรหัสผ่านใหม่ได้ทันที

source: Sign Up
th: สมัครสมาชิก

source: Create Your Account
th: สร้างบัญชีผู้ใช้ของคุณ

source: Already have an account?
th: มีบัญชีอยู่แล้วใช่ไหม?

source: Login
th: เข้าสู่ระบบ

source: or
th: หรือ

source: Sign up with Google
th: สมัครสมาชิกด้วย Google

source: About Us
th: เกี่ยวกับเรา

source: Fashion that loves the Earth
th: แฟชั่นที่ใส่ใจโลก

source: MindVibe is on a mission to slow down fast fashion through mindful renting.
th: MindVibe อยากชวนทุกคนมาเช่าเสื้อผ้า เพื่อลดการผลิตเกินจำเป็น และดูแลโลกไปพร้อมกัน

source: Why Choose Second-Hand?
th: ทำไมถึงควรลองใส่มือสอง?

source: Reduce textile waste and lower your carbon footprint
th: ลดขยะผ้า และลดผลกระทบต่อสิ่งแวดล้อม

source: Extend the life of quality fashion
th: ให้เสื้อผ้าดี ๆ ได้ใช้งานคุ้มค่า

source: Save money while staying stylish
th: ประหยัดขึ้น แต่ยังแต่งตัวได้สวยเหมือนเดิม

source: Support ethical and mindful fashion choices
th: เลือกแฟชั่นที่ไม่เบียดเบียนใคร และใส่ใจโลก

source: Be part of a global movement for circular fashion
th: ร่วมเปลี่ยนโลกแฟชั่นให้หมุนเวียนและยั่งยืน

source: Our Impact
th: เมื่อเราร่วมมือกัน โลกก็เปลี่ยนได้

source: Every rental makes a difference. Here's what we've achieved together.
th: ทุกครั้งที่คุณเช่า ช่วยเปลี่ยนอะไรบางอย่างเสมอ นี่คือสิ่งที่เราทำร่วมกัน

source: Outfits Rented
th: จำนวนชุดที่ถูกนำกลับมาใช้อีกครั้ง

source: View Source
th: ดูแหล่งที่มา

source: New Clothes Saved from Production
th: จำนวนเสื้อผ้าที่ไม่ต้องผลิตเพิ่ม

source: Textile Waste Avoided (tons)
th: ขยะผ้าที่เราช่วยกันลด (ตัน)

source: Sustainable Fashion
th: แฟชั่นที่ยั่งยืน

source: Image: Clothes given a second life through our platform.
th: ภาพ: เสื้อผ้าที่ได้กลับมาใช้งานอีกครั้งผ่านแพลตฟอร์มของเรา

source: Join the Movement
th: มาเป็นส่วนหนึ่งของความเปลี่ยนแปลง

source: Be part of the shift. Rent consciously, wear joyfully, and help us shape the future of fashion.
th: เช่าอย่างตั้งใจ ใส่ด้วยความสุข แล้วช่วยกันสร้างอนาคตใหม่ของแฟชั่น

source: Browse Our Outfits
th: เลือกชมชุดสวยๆ

source: Home
th: หน้าหลัก

source: All Outfits
th: ชุดทั้งหมด

source: Cart
th: ตะกร้าเช่า

source: Orders
th: คำสั่งเช่าของฉัน

source: Logout
th: ออกจากระบบ

source: Rent pre-loved outfits 🌿 Help reduce waste. Say no to fast fashion.
th: เช่าชุดสวยมือสอง 🌿 ร่วมลดขยะแฟชั่น และใส่ใจโลกไปด้วยกัน

source: All rights reserved.
th: สงวนลิขสิทธิ์

source: Together we slow down fast fashion ♻️
th: มาร่วมกันชะลอ Fast Fashion เพื่อโลกของเรา ♻️

source: Shopping Cart
th: ตะกร้าเช่าสินค้า

source: Your Shopping Cart
th: ตะกร้าเช่าของคุณ

source: Price/Day
th: ราคา/วัน

source: Subtotal/Day
th: รวมต่อวัน

source: Manage
th: จัดการ

source: No Image
th: ไม่มีรูปภาพ

source: Remove
th: นำออก

source: Subtotal (Per Day):
th: ยอดรวม (ต่อวัน):

source: Continue Shopping
th: เลือกชมชุดต่อ

source: Proceed to Checkout
th: ไปหน้าชำระเงิน

source: Your shopping cart is empty.
th: ตะกร้าเช่าของคุณยังว่าง

source: Start Shopping Now!
th: เริ่มเลือกชุดสวยเลย!

source: Checkout - Confirm Rental Information
th: ยืนยันข้อมูลการเช่าและชำระเงิน

source: Confirm Rental Information
th: ยืนยันข้อมูลการเช่า

source: Contact & Rental Dates
th: ข้อมูลติดต่อและวันเช่า-คืน

source: Confirm and Proceed
th: ยืนยันและดำเนินการต่อ

source: Order Summary
th: สรุปคำสั่งเช่า

source: day
th: วัน

source: Subtotal (Per Day)
th: ยอดเช่า (ต่อวัน)

source: Shipping
th: ค่าจัดส่ง

source: Free
th: ฟรี

source: Estimated Total
th: ยอดรวมที่ประมาณไว้

source: Calculated after rental duration
th: คำนวณตามจำนวนวันเช่า

source: The final total will be shown after rental duration is calculated on the next page.
th: ยอดชำระรวมจะแสดงในหน้าถัดไป หลังจากคำนวณตามจำนวนวันเช่า

source: (No Image Available)
th: (ไม่มีรูปภาพ)

source: Pre-loved
th: ชุดแฟชั่นสวย อบอุ่นหัวใจ ใช้ซ้ำอย่างยั่งยืน

source: Category:
th: หมวดหมู่:

source: Rental Price:
th: ราคาเช่า:

source: Every rental helps reduce waste and gives this outfit a second life 🌱
th: ทุกชุดที่คุณเลือกเช่า คืออีกหนึ่งก้าวในการถนอมโลก และส่งต่อความสวยอย่างยั่งยืน 🌱

source: Current Status (Today):
th: สถานะปัจจุบัน (วันนี้):

source: This item is already in your cart.
th: ชุดนี้อยู่ในตะกร้าเช่าของคุณแล้ว

source: Go to Cart
th: ไปที่ตะกร้าเช่า

source: Add to Cart
th: เพิ่มลงตะกร้าเช่า

source: (Item may be unavailable for today or currently rented)
th: (ชุดนี้อาจไม่ว่างให้เช่าในวันนี้ หรือกำลังมีผู้เช่าอื่นใช้งานอยู่)

source: (This outfit is currently inactive)
th: (ชุดนี้ยังไม่เปิดให้เช่าในขณะนี้)

source: Related Outfits
th: ชุดที่คล้ายกัน

source: (No Image)
th: (ไม่มีรูปภาพ)

source: View
th: ดูรายละเอียด

source: Style with Purpose.
th: สไตล์ที่ใช่ ใส่ใจโลก

source: Wear second-hand. Love the planet. Join the movement against fast fashion.
th: เลือกชุดแฟชั่นรักษ์โลก ใส่ใจสิ่งแวดล้อม ร่วมเป็นส่วนหนึ่งของการเปลี่ยนแปลง ลดแฟชั่นสิ้นเปลือง

source: Discover Collection
th: เลือกชมคอลเลกชัน

source: Featured Outfits
th: ชุดแนะนำ

source: Details
th: รายละเอียด

source: Initiate Return
th: แจ้งคืนสินค้า

source: Initiate Item Return
th: ทำรายการแจ้งคืนสินค้า

source: Rental Period:
th: ระยะเวลาเช่า:

source: to
th: ถึง

source: Items:
th: รายการสินค้า:

source: Enter Return Details
th: กรอกรายละเอียดการส่งสินค้าคืน

source: Confirm Return Submission
th: ยืนยันการทำรายการแจ้งคืนสินค้า

source: Cancel and return to order details
th: ยกเลิกและกลับไปยังหน้ารายละเอียดคำสั่งเช่า

source: Search outfits...
th: ค้นหาชุด...

source: Search
th: ค้นหา

source: Category: %(category.name)s
th: หมวดหมู่: %(category.name)s

source: Discover pre-loved fashion that supports a greener world. Every rented outfit helps reduce textile waste and fast fashion impact. 🌱
th: ค้นพบแฟชั่นที่อบอุ่นหัวใจ และช่วยสร้างโลกที่น่าอยู่มากขึ้น ทุกการเช่าของคุณช่วยลดขยะสิ่งทอและผลกระทบจาก Fast Fashion อย่างยั่งยืน 🌱

source: No outfits found matching your search for "%(query)s".
th: ไม่พบชุดที่ตรงกับคำค้นหา "%(query)s" ของคุณ

source: No outfits found in the "%(category.name)s" category yet.
th: ยังไม่มีชุดในหมวดหมู่ "%(category.name)s"

source: No outfits available at the moment.
th: ขณะนี้ยังไม่มีชุดให้เช่า

source: View All Outfits
th: เลือกชมชุดทั้งหมด

source: First
th: หน้าแรกสุด

source: Previous
th: ก่อนหน้า

source: Page %(page_obj.number)s of %(page_obj.paginator.num_pages)s.
th: หน้า %(page_obj.number)s จากทั้งหมด %(page_obj.paginator.num_pages)s หน้า

source: Next
th: ถัดไป

source: Last
th: หน้าสุดท้าย

source: Order Details #%(order_id)s
th: รายละเอียดคำสั่งเช่า #%(order_id)s

source: General Information
th: ข้อมูลทั่วไปของคำสั่งเช่า

source: Date Placed
th: วันที่สั่งเช่า

source: Order By
th: สั่งเช่าโดย

source: Customer & Shipping
th: ข้อมูลลูกค้าและที่อยู่จัดส่ง

source: Name
th: ชื่อและนามสกุล

source: Phone
th: เบอร์โทรศัพท์

source: Shipping Tracking
th: ติดตามพัสดุ (จากเรา)

source: Return Tracking
th: ติดตามพัสดุ (ที่ส่งคืน)

source: View Image
th: ดูรูปภาพ

source: Return Initiated
th: เริ่มขั้นตอนการส่งคืน

source: Rental Period & Items
th: ระยะเวลาเช่าและรายการสินค้า

source: Duration
th: ระยะเวลาเช่า

source: Qty
th: จำนวน

source: Total
th: รวม

source: Payment Information
th: ข้อมูลการชำระเงิน

source: Payment Status
th: สถานะการชำระเงิน

source: Confirmed
th: ชำระเงินแล้ว

source: Awaiting Approval
th: รอการตรวจสอบ

source: Failed/Incorrect
th: การชำระเงินล้มเหลว / ข้อมูลไม่ถูกต้อง

source: Not Paid
th: ยังไม่ได้ชำระเงิน

source: Transfer Date/Time (Reported)
th: วันที่/เวลาโอน (ตามที่แจ้ง)

source: Attached Slip
th: สลิปที่แนบ

source: Payment Slip for Order #%(order_id)s
th: สลิปชำระเงินสำหรับคำสั่งเช่า #%(order_id)s

source: Submit Payment Proof
th: แจ้งหลักฐานการโอนเงิน

source: Admin Note
th: หมายเหตุจากแอดมิน

source: Back to Order History
th: กลับไปที่ประวัติการเช่า

source: Order History
th: ประวัติคำสั่งเช่า

source: Your Order History
th: ประวัติคำสั่งเช่าของคุณ

source: Order ID
th: เลขที่คำสั่งเช่า

source: Rental Start
th: เริ่มเช่าวันที่

source: Rental End
th: คืนสินค้าวันที่

source: View Details
th: ดูรายละเอียด

source: You haven't placed any orders yet.
th: คุณยังไม่มีประวัติการเช่าสินค้า

source: Browse Outfits
th: เลือกชมชุดสวยๆ

source: Submit Payment
th: แจ้งการชำระเงิน

source: For Rental Order: #%(order_id)s
th: สำหรับคำสั่งเช่า: #%(order_id)s

source: Payment Details
th: รายละเอียดการชำระเงิน

source: Amount Due
th: ยอดที่ต้องชำระ

source: Pay via PromptPay
th: ชำระผ่านพร้อมเพย์

source: PromptPay QR Code
th: QR Code พร้อมเพย์

source: PromptPay
th: พร้อมเพย์

source: Account
th: บัญชี

source: Payment QR code is currently unavailable.
th: ขณะนี้ QR Code สำหรับชำระเงินยังไม่พร้อมใช้งาน

source: Please contact support for payment instructions.
th: กรุณาติดต่อเจ้าหน้าที่เพื่อสอบถามช่องทางการชำระเงิน

source: Upload Payment Slip
th: อัปโหลดสลิปโอนเงิน

source: Confirm Payment Submission
th: ยืนยันการแจ้งชำระเงิน

source: Your payment for Order #%(order_id)s is currently awaiting approval.
th: การชำระเงินสำหรับคำสั่งเช่า #%(order_id)s กำลังรอการตรวจสอบ

source: Payment for Order #%(order_id)s was unsuccessful or the slip was incorrect.
th: การชำระเงินสำหรับคำสั่งเช่า #%(order_id)s ล้มเหลว หรือสลิปที่แนบมาไม่ถูกต้อง

source: Admin Note:
th: หมายเหตุจากแอดมิน:

source: Please contact support or try submitting payment again if applicable.
th: กรุณาติดต่อเจ้าหน้าที่ หรือลองแจ้งการชำระเงินอีกครั้ง (ถ้ามี)

source: View Order Details
th: ดูรายละเอียดคำสั่งเช่า

source: Payment Result
th: ผลการชำระเงิน

source: View Order History
th: ดูประวัติคำสั่งเช่า

source: Rental Price
th: ราคาเช่า:

source: Baht
th: บาท

source: Rental duration (days)
th: จำนวนวันเช่า

source: Rent this outfit
th: เช่าชุดนี้เลย!

source: Search Results for '%(query)s'
th: ผลการค้นหาสำหรับ: '%(query)s'

source: Search Outfits
th: ค้นหาชุด

source: Please enter a search term in the form above.
th: กรุณากรอกคำค้นหาในช่องค้นหาด้านบน

source: Page %(page_obj.number)s of %(page_obj.paginator.num_pages)s
th: หน้า %(page_obj.number)s จาก %(page_obj.paginator.num_pages)s

source: Edit Profile
th: แก้ไขโปรไฟล์

source: Edit Your Profile
th: แก้ไขโปรไฟล์ของคุณ

source: Username
th: ชื่อผู้ใช้

source: cannot be changed
th: (ไม่สามารถแก้ไขได้)

source: Date Joined
th: วันที่เข้าร่วม

source: Account Information
th: ข้อมูลบัญชีผู้ใช้

source: Contact / Saved Address
th: ข้อมูลติดต่อ / ที่อยู่สำหรับจัดส่งที่บันทึกไว้

source: Save Changes
th: บันทึกการเปลี่ยนแปลง

source: Want to change your password?
th: ต้องการเปลี่ยนรหัสผ่านใช่ไหม?

source: Sign In with Google
th: เข้าสู่ระบบด้วย Google

source: You are about to sign in using your Google account.
th: คุณกำลังเข้าสู่ระบบด้วยบัญชี Google

source: Continue
th: ดำเนินการต่อ

source: Back to Login
th: กลับไปหน้าเข้าสู่ระบบ
